{
  "title": "DEVELOPPEUR WEB",
  "welcome": "BIENVENUE !",
  "welcomeText": "Salut, je suis Xavier NESMOND. Développeur web, depuis 2023, je suis diplômé de INSA Lyon, spécialité Télécommunications, Services et Usages. Je suis ouvert à des jobs en freelance ou des CDI. Mes frameworks de prédilections sont Vue JS, React JS et React Native. Je maîtrise le Javascript et TypeScript.",
  "about": "EN SAVOIR PLUS SUR MOI...",
  "aboutText": "Ah vous êtes curieux de me connaître, je suis un fier Martiniquais. J’espère que vous avez apprécié mon design, ",
  "aboutPageLink": "cliquez pour en connaître un peu plus sur moi",
  "aboutFirstParagraph": "Né en Martinique, j’ai vécu toute ma vie sur cette île paradisiaque  avant d’habiter en France pour mes études. Pendant mon enfance j’ai eu l’occasion de réaliser de nombreux voyages, ce qui m’a permis de développer ma passion pour l’art et la science.",
  "aboutSecondParagraph": "Ma passion pour la programmation est née lors de mes premières années d’étude à travers d’un projet en cours d'algorithmie. En équipe de trois nous devions coder un simple jeu vidéo avec Java. L’univers de la Télécommunication m'a semblé être la spécialité qui me correspondait car en plus d’agrandir mes connaissances en Informatique, je voulais découvrir comment fonctionnait les réseaux. Cette spécialisation m’a permis de découvrir divers langages de programmation (C/C++,Haskell,Go,...), ces différentes découvertes ont renforcé ma volonté de devenir développeur. Un des projets phare qui m’a poussé précisément vers le Web est mon tout premier projet web en troisième année, où en équipe de 5 étudiants j’ai réalisé un site de streaming de musique. Tout d’abord je travaillais sur un algortihme Matlab pour la création de playlists, puis j’ai rejoint l’équipe Frontend. J’y ai découvert Vue Js et le CSS. J’ai eu l’occasion de mêler ma créavité et mes connaissances.",
  "aboutThirdParagraph": "Lors de mon premier stage en 4e année, j’ai voulu tenté quelque chose de différent que le code “pur” en faisaint un stage en tant que Consultant SalesForce chez Shaple, une start-up qui propose des prestations de services SalesForce et Okta. J’ai rapidement compris que je voulais faire du développement car ma partie préférée du stage a été d’écrire du code. Avant de réaliser mon stage de fin d’étude à SOLUTEC, j’ai aussi développé une application mobile avec une équipe de 5 de jeu de Dominos. J’étais responsable  de la partie multijoueur que j’ai réalisé avec Firebase RealTime Database . ",
  "aboutFourthParagraph": "En dehors du travail, je suis un grand passioné de basketball, particulièrement de NBA, j’ai joué en compétition pendant plus de 7 ans et je continue en playground. L'art joue aussi un rôle important dans ma vie, je dessine encore beaucoup et de temps en temps je continue à pratiquer de la guitare basse.",
  "aboutFifthParagraph": "Ma philosophie de travail est centrée sur l’écoute des besoins du clients à l’aide d’une communication claire. Je priorise la compréhension du besoin pour lui remettre un travail qui correspond à ses attentes.",
  "contact": "CONTACTEZ MOI",
  "workExperience": "EXPÉRIENCES PROFESSIONNELLES",
  "sapphireSpaceTitle": "SAPPHIRE.SPACE",
  "sapphireSpaceResume": "Mon premier projet de freelance, le client de ce projet avait besoin d’un site web pour montrer des modèles 3D de leurs produits. J’ai réalisé ce projet en",
  "sapphireSpaceObjective": "Objectif du projet: Création d'un site web destiné à la présentation de modèles 3D. ",
  "sapphireSpaceFirstParagraph": "Sapphire.space a été ma première expérience freelance. Le client de ce premier projet avait besoin d'une plateforme pour mon montrer leur expertise : la découpe de sapphires industriels. Leur souhait était d’avoir un site qui montrait des modèles 3d de qualité.",
  "sapphireSpaceSecondParagraph": "Le projet m’a été proposé avec une stack technique fixée. Ce projet demandait de réaliser 2 sites webs :  un ecommerce avec un design remis par le client et un site admin, ou j’ai eu la liberté de designer. J’ai initié le développement en mettant en place une REST API pour gérer les opérations CRUD pour la gestion des sapphires en créant les modèles de données en respectant les demandes du client.",
  "sapphireSpaceThirdParagraph": "Stocker les modèles a été le premier défi du projet. En effet les modèles sont des fichiers lourds de formats .glb ou .gltf. Pour mon choix de database, j’ai tout d’abord décidé d’utiliser Mongo.DB et leur GridFS qui permet de stocker en plusieurs chunks des fichiers lourds.",
  "sapphireSpaceFourthParagraph": "Pour le déploiement le client souhait déployer sur Infomaniak, mais pour utiliser le maximum des performances de Next JS, je lui ai proposé un déploiement avec AWS. Pour mes serveurs j’ai donc utilisé des instances EC2. Le monitoring est géré avec PM2 et Docker, j’ai utilisé Nginx pour la configuration serveur. Les sites sont certifiées https.",
  "sapphireSpaceFifthParagraph": "Le plus gros défi de ce projet était de pouvoir fournir au visiteur une expérience de qualité en s’assurant de montrer des modèles de haute qualité et donc très lourd. De plus, une seconde difficulté était la configuration de Three.js. Pour palier à ce problème de configuration je me suis tourné vers l’utilisation de Model Viewer. Malgré ce premier problème de régler, la qualité des modèles n’étaient toujours pas aux attentes du clients car les conversions en chunks perdaient quelques données.\n\nJ’ai donc changé de stratégie en optant à l’utilisation de S3 Buckets pour le stockage des modèles. Je n’avais donc plus de problèmes de conversions de données et je me suis concentré sur le design du site web. \n\nA l’aide de Tailwind CSS, j’ai pu proposer aux clients de beaux designs qui respectait leur demande et j’ai ajouté l’utilisation de composants UI de la librairie Daisy UI, simplifiant la configuration des différents pages.",
  "sapphireSpaceResumeLink": "Next Js, ReactJS.",
  "colibriSOPText": "Ma première expérience professionnelle en CDI, j’étais un développeur frontend  chez l’éditeur de logiciel Colibri S&OP. J’ai travaillé en ",
  "colibriSOPTitle": "COLIBRI S&OP",
  "colibriSOPLink": "JavaScript et VueJS.",
  "colibriSOPFirstParagraph": "Lorsque j’étais à Colibri mon rôle principal était de faciliter la transition de JavaScript à Vue.JS, tout en réalisant les tâches de debug du groupe de développeur sur leur produit de Demand & Supply.",
  "colibriSOPSecondParagraph": "Même si mon temps a été bref, j’ai progressé énormément en JavaScript en travaillant avec jQuery et Vue JS. D’ailleurs, j’ai  ajouté un nouveau framework d’élément UI dans mon arc: Kendo UI. J’ai aussi amélioré mes notions de code clean en profitant du debug pour faire du refactoring.",
  "finalIntershipTitle": "STAGE FINAL",
  "finalInternshipResume": "Lors de mon stage de fin d’étude, j’ai travaillé en tant que développeur FullStack sur la stack technique ",
  "finalInternshipResumeLink": "Node JS, TypeScript and Vue.JS",
  "finalIntershipFirstParagraph": "Lors de mon stage d’étude,j’ai travaillé en équipe de stagiaires à Solutec Lyon au lab’Solutec. J’ai travaillé en tant que Développeur FullStack. L’objectif principal du projet de mon stage consistait à la refonte d’une application existante pour un client.",
  "finalIntershipSecondParagraph": "La fonctionnalité principale de cette application de faciliter le management de l’infogérance de la DSI de la métropole du Grand Lyon. Ils doivent assurer la continuité de service du parc informatique.",
  "finalIntershipSecondBParagraph": "Les manager avaient pour tâche d’organiser les emplois du temps des membres du services. Lors de cette refonte nous changions de stack technique, l’ancienne étant Php, Angular on passait à TypeScript, Node JS et Vue JS.",
  "finalIntershipThirdParagraph": "Nous avions différents axes d’amélioration pour ce projet. Le plus visible selon mon équipe était le design qui paraissait vieillissant. Les autres axes étaient liés à l’architecture technique. On passait d'une achitecture monolithique à une en microservices.",
  "finalIntershipFourthParagraph": "Après une bonne compréhension du contenu de notre projet, la première étape a été la création des maquettes de notre refonte. Nous avons les réalisés à l’aide de Figma, l’objectif était d’amélioré l’utilisation de l’espace dans l’application et la rendre la plus moderne. Nous avons eu la chance de faire valider nos maquettes avec le client directement qui nous donnait des retours précis.  Nous nous sommes concentrés principalement sur leur expérience utilisateur. Ceci m’a permis à apprendre à maitriser Figma et de produire des designs de qualités.",
  "finalIntershipFifthParagraph": "Après les designs nous sommes montés en compétences sur les différentes compétences et technologies. Nous avons lors de notre Sprint 0 réalisé un simple site NBA qui récupérait des résultats de match à part d’une Api, nous nous sommes aussi habitués à la librairie de composants Vuetify. ",
  "finalIntershipSixthParagraph": "Quand nous avons fini notre premier projet nous étions prêts à commencer le projet principal. La première étape a été la configuration de notre projet en commençant par la hiéréarchie de notre dossier et l’installation des dépendances que nous  utiliserions. Nous développions en TDD: Test Driven Developement en utilisant comme framework de test Jest. Nous utilisions aussi Vite pour accélérer notre temps de build et faciliter le développement.",
  "finalIntershipSeventhParagraph": "J’étais en charge de la configuration de la CI/CD de GitLab. A cause de notre architecture en microservices, les scripts de CI/CD pouvaient devenir long. Heureusement en utilisant les Keyword de GitLab j’ai pu réduire la longueur des fichiers de scripts drastiquement. J’étais aussi en charge de la configuration de Sonarqube. Nous avions un pourcentage de code à tester très haut (80%).",
  "finalIntershipEighthParagraph": "Pour faciliter l’utilisation de nos bases de données on utilisait l’ORM : Sequeelize/Umzug. Au niveau de notre frontend on codait en  Vue JS(Composition Api) avec Pinia. Ceci nous a permis de proposer une expérience utilisateur dynamique et améliorer la réacitivité de nos composants.\n\nNos services étaient conteneurisés avec Docker.",
  "skills": "COMPÉTENCES",
  "copiedToClipboard": "Copié dans le presse papier"
}
