{
  "title": "WEB DEVELOPER",
  "welcome": "WELCOME",
  "welcomeText": "Hello, I am Xavier NESMOND. I am a Frontend Developer since 2023. Degreed from INSA Lyon . I am available for freelance contracts or jobs. My favorite frameworks are Vue JS, React JS and React Native. I also work in TypeScript and JavaScript",
  "about": "MORE ABOUT ME",
  "aboutText": "Oh you are curious about me, I am a proud french west' indian from Martinique. I hope you liked my portfolio design, ",
  "aboutPageLink": "click to see more about my story",
  "aboutFirstParagraph": "Originally from the beautiful island of Martinique. I spent my childhood and youth in this island paradise before moving to France for my studies. While I was a child, I traveled a lot, I developed a deep interest in sciences and arts.",
  "aboutSecondParagraph": "As an INSA engineer specialized in Telecommunications, Services, and Uses, I discovered my passion for programming in my first year of university by creating a Java video game. My interest in the field of telecommunications stemmed from a desire to understand both computer science and networks. This specialization offered me the opportunity to delve into various programming languages, thus reinforcing my love for coding. A pivotal project in my career was the creation of a web application for a music streaming site, where we developed a unique algorithm to generate playlists based on genres, tones, and BPM of the music. Through this project, realized in Vue JS, I discovered my passion for frontend development, an area where I could combine my passions for art and science.",
  "aboutThirdParagraph": "I started my professional exploration with an internship at Shaple as a SalesForce consultant, but I quickly realized that my true passion was active development, particularly with JavaScript. Before my end-of-studies internship, I also contributed to the creation of Domilo, a mobile domino game developed in Java with Android Studio, where I mainly worked on the multiplayer part with Firebase. After my studies, I joined COLIBRI S&OP as a frontend developer. I also worked in freelance and delivered the sapphire.space website.",
  "aboutFourthParagraph": "Outside of work, I am passionate about basketball, particularly the NBA, and I continue to play regularly. Art also plays a predominant role in my life, whether through drawing or music, where I express myself by playing the bass.",
  "aboutFifthParagraph": "My work philosophy is centered on attentive listening to clients' needs and clear communication. I prioritize a deep understanding of projects to provide solutions that precisely meet clients' expectations.",
  "contact": "CONTACT ME",
  "workExperience": "WORK EXPERIENCES",
  "sapphireSpaceTitle": "SAPPHIRE.SPACE",
  "sapphireSpaceResume": "My first freelance project. My client needed a website to showcase sapphires with 3D models. I did this project with",
  "sapphireSpaceResumeLink": "Next Js, ReactJS.",
  "sapphireSpaceObjective": "Project Objective: Develop a website to showcase 3D models",
  "sapphireSpaceFirstParagraph": "Sapphire.space marked my inaugural venture as a freelancer. The client sought a platform to exhibit their expertise in coring industrial sapphires, emphasizing the need for a visually captivating website that could showcase 3D models of sapphires and various coring plans.",
  "sapphireSpaceSecondParagraph": "As the sole contributor to this project, I adhered to the predetermined tech stack specified by the client. The scope encompassed the creation of two distinct websites: an ecommerce site with a predefined design and an admin site, where I had the creative liberty to design. Initiating the development process, I began by establishing a REST API to handle fundamental operations such as creating, editing, and deleting sapphires, each equipped with customer-centric information like name, ID, serial number, and more.",
  "sapphireSpaceThirdParagraph": "The primary challenge arose in storing the substantial 3D model files in .glb or .gltf formats. Opting for MongoDB, I configured GridFS storage to manage these large files efficiently.",
  "sapphireSpaceFourthParagraph": "For deployment, despite the client's preference for Infomaniak, I opted for Next.js to enhance the user experience, necessitating a non-static deployment. Monitoring was facilitated through PM2 and Docker, with Nginx utilized for server configuration. The deployment was further secured through HTTPS certification",
  "sapphireSpaceFifthParagraph": "Subsequently, I encountered difficulties in rendering 3D models directly using Three.js. Overcoming issues related to complex configurations, unrecognized camera settings, and suboptimal positioning of sapphires, I pivoted to employing Model Viewer, yielding vastly improved results.\n\nDespite this progress, a disparity in quality persisted due to data loss during storage in GridFS. To rectify this, I transitioned to using S3 Buckets, resolving the data conversion issues and preserving model quality. With these challenges addressed, I shifted my focus to refining the website's design.\n\nLeveraging Tailwind CSS for styling, I streamlined my development process. Additionally, I incorporated Daisy UI to enhance UI components, simplifying the configuration process.",
  "colibriSOPTitle": "COLIBRI S&OP",
  "colibriSOPText": "My first work experience as a frontend developer. I work at Colibri S&OP with the stack ",
  "colibriSOPLink": "JavaScript and VueJS.",
  "colibriSOPFirstParagraph": "During my time at Colibri, my primary role was to facilitate the transition from JavaScript to Vue JS, alongside engaging in debugging tasks. Colibri, a software publisher, specialized in developing solutions for Sales and Operating Planning systems.",
  "colibriSOPSecondParagraph": "Although my time there was brief, I gained significant experience working with both jQuery and Vue JS. Additionally, I expanded my skill set by learning to work with Kendo UI. My central responsibility involved refactoring legacy code and eliminating bugs, ensuring smoother and more efficient software performance.",
  "finalIntershipTitle": "FINAL INTERNSHIP",
  "finalInternshipResume": "For my final internship I developed an application using a microservice achirtecture with",
  "finalInternshipResumeLink": "Node JS, TypeScript and Vue.JS",
  "finalIntershipFirstParagraph": "In my final internship, I worked in a team with four interns at Solutec Lyon in the lab’Solutec. I work as a fullStack Developer. Our main objective was the rework of an existing application for a client. ",
  "finalIntershipSecondParagraph": "The main functionnality of the application was to help the management to assure the continuity of service. They were managing  the Information System of the metropole of Grand Lyon. They need to respect a lot of different contraints.",
  "finalIntershipSecondBParagraph": "The manager role was to schedule the actions of their service members. The stack of the old application was Angular PHP.  The stack that we need to create was  a more modern one : Vue Js, TypeScript, Node JS. ",
  "finalIntershipThirdParagraph": "We had different axes of amelioration for this project, the most visible was the design. It was really old looking, the other axes was the performances. The old app was using a monolothic architecture. For our rework we were using a microservices architecture. ",
  "finalIntershipFourthParagraph": "After we understand the main objective of our project, we needed to create the new designs. We designed them with Figma, our main focus was to better their initial view. The user experience was our main focus, we had the chance to make differents meetings with the managers. They helped us understand they needs and it permits us to design better views. I learned to use Figma and now I am able to provide Figma Design of quality. This part of the project was really important and interesting to do. At first sight, the work and the challenge of the managers were quite difficult to understand but after the design it become more clearly for us. ",
  "finalIntershipFifthParagraph": "Next we had to gain experience, and better our skills. To do this, our tutor gave us a small project to do. It was a simple a nba website who was retreiving results through a REST API. ",
  "finalIntershipSixthParagraph": "When we finished our small starter project we were ready to start our main project. The first step of the project was the directory hierarchy and the installation of all dependencies. Our main stack was Vue JS, TypeScript and Node JS. But it was not all the framework we used. We were developping using Test Driven Devolpment. We were using Jest for our unit testing. We were also using Vite to accelerate our build time. ",
  "finalIntershipSeventhParagraph": "I was in charge of the configuration of the Gitlab CI/CD. Because we were working in a microservices architecture, all the services needed their CI/CD scripts but to not repeat all the configuration I created scripts using GitLab keywords. I was also in charge of the Sonarqube configuration. We had a great quality limit to respect (a score higher than 80).",
  "finalIntershipEighthParagraph": "To facilitate the use of the database we were using an ORM :  Sequeelize/Umzug. At our frontend level, we were using the Composition Api of Vue JS with Pinia. It help us have a great user experience to have dynamic fecthing and reactivity between our components. To simplify our design we used Vuetify components. Our services was conteneurised with Docker.",
  "skills": "SKILLS",
  "copiedToClipboard": "Copied to clipboard"
}
